---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.InvalidCurveForElement
source: html/2a8ee5e1-a8eb-dd16-7070-946003343fbb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.InvalidCurveForElement Property

End positions are invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidCurveForElement { get; }
```